redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_i2c_slave.c
 *
 *   Copyright (C) 2018 zGlue Inc. All rights reserved.
 *   Author: Zhengwei Wang <zhengwei@zglue.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/semaphore.h>
#include <nuttx/wqueue.h>
#include <nuttx/i2c/i2c_slave.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"

#include "chip.h"
#include "nrf.h"
#include "nrf_error.h"
#include "nrf_twis.h"
#include "nrf52_gpio.h"

#if defined(CONFIG_NRF52_I2CS0) || defined(CONFIG_NRF52_I2CS1)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
/* Configuration ********************************************************************/
/* CONFIG_I2C_POLLED may be set so that I2C interrupts will not be used.  Instead,
 * CPU-intensive polling will be used.
 */

/* Interrupt wait timeout in seconds and milliseconds */




// All interrupt flags
#define DISABLE_ALL_INT_SHORT  0xFFFFFFFF

#define NRF52_TWIM_TXRX_MAXLENGTH 0xff       /*max buffer length in one transfer*/

#define EVT_TO_STR_TWIS(event)  (event == NRF_TWIS_EVENT_STOPPED ? "NRF_TWIS_EVENT_STOPPED" :                      \
                                (event == NRF_TWIS_EVENT_ERROR ? "NRF_TWIS_EVENT_ERROR" :                          \
                                (event == NRF_TWIS_EVENT_RXSTARTED ? "NRF_TWIS_EVENT_RXSTARTED" :                  \
                                (event == NRF_TWIS_EVENT_TXSTARTED ? "NRF_TWIS_EVENT_TXSTARTED" :                  \
                                (event == NRF_TWIS_EVENT_WRITE ? "NRF_TWIS_EVENT_WRITE" :                  \
                                (event == NRF_TWIS_EVENT_READ ? "NRF_TWIS_EVENT_READ" : "NRF_TWIS_EVENT_UNKNOWN"))))))

#define STATUS_TO_STR_TWIM(status)  (status == NRF52_TWIS_STATE_IDLE ? "NRF52_TWIS_STATE_IDLE" :                      \
                                (status == NRF52_TWIS_STATE_READ_WAITING ? "NRF52_TWIS_STATE_READ_WAITING" :                          \
                                (status == NRF52_TWIS_STATE_READING ? "NRF52_TWIS_STATE_READING" :                  \
                                (status == NRF52_TWIS_STATE_WRITE_WAITING ? "NRF52_TWIS_STATE_WRITE_WAITING" :                  \
                                (status == NRF52_TWIS_STATE_WRITING ? "NRF52_TWIS_STATE_WRITING" : "NRF52_TWIS_STATE_UNKNOWN")))))

#define NRF_DRV_COMMON_EVREGS_OFFSET 0x100U


/****************************************************************************
 * Private Types
 ****************************************************************************/
/* Interrupt state */

typedef enum
{
  INTSTATE_IDLE = 0,      /* No I2C activity */
  INTSTATE_WAITING,       /* Waiting for completion of interrupt activity */
  INTSTATE_DONE,          /* Interrupt activity complete */
} nrf52_tmis_intstate_t;

/**
 * @brief Actual state of internal state machine
 */
typedef enum
{
  NRF52_TWIS_STATE_IDLE,          ///< No ongoing transmission
  NRF52_TWIS_STATE_READ_WAITING,  ///< Read request received, waiting for data
  NRF52_TWIS_STATE_READING,  ///< Reading is actually pending (data sending)
  NRF52_TWIS_STATE_WRITE_WAITING, ///< Write request received, waiting for data buffer
  NRF52_TWIS_STATE_WRITING, ///< Writing is actually pending (data receiving)
} nrf52_twis_state_t;


/* I2C Device hardware configuration */

struct nrf52_i2cs_config_s
{
  uint32_t base;              /* I2C base address */
  uint32_t scl_pin;           /* GPIO configuration for SCL as SCL */
  uint32_t sda_pin;           /* GPIO configuration for SDA as SDA */
  nrf_gpio_pin_pull_t sda_pullup;
  nrf_gpio_pin_pull_t scl_pullup;
  uint32_t irqno;            /* IRQ number*/
};

/* I2C Device Private Data */

struct nrf52_i2cs_priv_s
{
  const struct i2c_slaveops_s *ops; /* Standard I2C operations */
  const struct nrf52_i2cs_config_s *config; /* Port configuration */
  int refs;                    /* Referernce count */
  int (*callback)(FAR void *, i2c_slave_flag );/*user callback function*/
  void *callback_args; /*args for the callback function*/
  sem_t sem_excl;              /* Mutual exclusion semaphore */
  sem_t sem_pend;              /*user are waitting for the read/write results*/
  struct work_s work;          /* this work will clear all apb buffers in the done queue */
  nrf52_twis_state_t status; /*current status*/
  bool flag_tx_buffer_set;  /*tx buffer set*/
  bool flag_rx_buffer_set;  /*tx buffer set*/
  bool tx_error;           /*set True when error happend during a tx transfer */
  bool rx_error;           /*set True when error happend during a rx transfer */
  int sended_length;       /*data length we sended*/
  int received_length;     /*data length we received*/
};


/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

static inline void nrf52_i2cs_sem_wait(FAR struct nrf52_i2cs_priv_s *priv);
static inline void nrf52_i2cs_sem_post(FAR struct nrf52_i2cs_priv_s *priv);
static inline void nrf52_i2cs_sem_init(FAR struct nrf52_i2cs_priv_s *priv);
static inline void nrf52_i2cs_sem_destroy(FAR struct nrf52_i2cs_priv_s *priv);
int nrf52_i2cs_enable(FAR struct i2c_slave_s *dev, int addr, int nbits);
int nrf52_i2cs_write(FAR struct i2c_slave_s *dev, FAR const uint8_t *buffer, int buflen);
int nrf52_i2cs_read(FAR struct i2c_slave_s *dev, FAR uint8_t *buffer, int buflen);
int nrf52_i2cs_registercb(FAR struct i2c_slave_s *dev,
                          int (*callback)(FAR void *arg, i2c_slave_flag flag),
                          FAR void *arg);




/****************************************************************************
 * Private Data
 ****************************************************************************/
struct i2c_slaveops_s nrf52_i2cs_ops =
{
  .setownaddress = nrf52_i2cs_enable,
  .write = nrf52_i2cs_write,
  .read = nrf52_i2cs_read,
  .registercallback = nrf52_i2cs_registercb,
};

#ifdef CONFIG_NRF52_I2CS0
static const struct nrf52_i2cs_config_s nrf52_i2cs0_config =
{
  .base       = NRF_TWIS0_BASE,
  .scl_pin    = BOARD_I2CS0_SCL_PIN,
  .sda_pin    = BOARD_I2CS0_SDA_PIN,

#ifdef BOADR_I2CS0_SCL_PULLUP_ENABLE
  .scl_pullup = NRF_GPIO_PIN_PULLUP,
#else
  .scl_pullup = NRF_GPIO_PIN_NOPULL,
#endif

#ifdef BOADR_I2CS0_SDA_PULLUP_ENABLE
  .sda_pullup = NRF_GPIO_PIN_PULLUP,
#else
  .sda_pullup = NRF_GPIO_PIN_NOPULL,
#endif

  .irqno      = SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn,
};

