redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
static struct nrf52_i2cs_priv_s nrf52_i2cs0_priv =
{
  .ops        = &nrf52_i2cs_ops,
  .config     = &nrf52_i2cs0_config,
  .refs       = 0,
  .callback   = NULL,
  .callback_args = NULL,
  .status = NRF52_TWIS_STATE_IDLE,
  .flag_tx_buffer_set = false,
  .flag_rx_buffer_set = false,
  .tx_error      = false,
  .rx_error      = false,
  .sended_length = 0,
  .received_length = 0,
};
#endif

#ifdef CONFIG_NRF52_I2CS1
static const struct nrf52_i2cs_config_s nrf52_i2cs1_config =
{
  .base       = NRF_TWIS1_BASE,
  .scl_pin    = BOARD_I2CS1_SCL_PIN,
  .sda_pin    = BOARD_I2CS1_SDA_PIN,

#ifdef BOADR_I2CS1_SCL_PULLUP_ENABLE
  .scl_pullup = NRF_GPIO_PIN_PULLUP,
#else
  .scl_pullup = NRF_GPIO_PIN_NOPULL,
#endif

#ifdef BOADR_I2CS1_SDA_PULLUP_ENABLE
  .sda_pullup = NRF_GPIO_PIN_PULLUP,
#else
  .sda_pullup = NRF_GPIO_PIN_NOPULL,
#endif

  .irqno      = SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn,
};

static struct nrf52_i2cs_priv_s nrf52_i2cs1_priv =
{
  .ops        = &nrf52_i2cs_ops,
  .config     = &nrf52_i2cs1_config,
  .refs       = 0,
  .callback   = NULL,
  .callback_args = NULL,
  .status = NRF52_TWIS_STATE_IDLE,
  .flag_tx_buffer_set = false,
  .flag_rx_buffer_set = false,
  .tx_error      = false,
  .rx_error      = false,
  .sended_length = 0,
  .received_length = 0,
};
#endif

/************************************************************************************
 * Name: nrf52_i2cs_sem_wait
 *
 * Description:
 *   Take the exclusive access, waiting as necessary
 *
 ************************************************************************************/

static inline void nrf52_i2cs_sem_wait(FAR struct nrf52_i2cs_priv_s *priv)
{
  int ret;

  do
    {
      /* Take the semaphore (perhaps waiting) */

      ret = nxsem_wait(&priv->sem_excl);

      /* The only case that an error should occur here is if the wait was
       * awakened by a signal.
       */

      DEBUGASSERT(ret == OK || ret == -EINTR);
    }
  while (ret == -EINTR);
}





/************************************************************************************
 * Name: nrf52_i2c_sem_post
 *
 * Description:
 *   Release the mutual exclusion semaphore
 *
 ************************************************************************************/

static inline void nrf52_i2cs_sem_post(struct nrf52_i2cs_priv_s *priv)
{
  nxsem_post(&priv->sem_excl);
}

/************************************************************************************
 * Name: nrf52_i2c_sem_init
 *
 * Description:
 *   Initialize semaphores
 *
 ************************************************************************************/

static inline void nrf52_i2cs_sem_init(FAR struct nrf52_i2cs_priv_s *priv)
{
  nxsem_init(&priv->sem_excl, 0, 1);
  nxsem_init(&priv->sem_pend, 0, 0);
}

/************************************************************************************
 * Name: nrf52_i2c_sem_destroy
 *
 * Description:
 *   Destroy semaphores.
 *
 ************************************************************************************/

static inline void nrf52_i2cs_sem_destroy(FAR struct nrf52_i2cs_priv_s *priv)
{
  nxsem_destroy(&priv->sem_excl);
  nxsem_destroy(&priv->sem_pend);
}

static inline uint32_t nrf52_i2cs_event_to_bitpos(uint32_t event)
{
  return (event - NRF_DRV_COMMON_EVREGS_OFFSET) / sizeof(uint32_t);
}


/**
 * @brief Auxiliary function for getting event state on right bit possition
 *
 * This function calls @ref nrf_twis_event_get function but the the result
 * is shifted to match INTEN register scheme.
 *
 * @param[in,out] p_reg TWIS to read  event from
 * @param ev  Event code
 *
 * @return Selected event state shifted by @ref nrf52_i2cs_event_to_bitpos
 *
 * @sa nrf_twis_event_get
 * @sa nrf52_i2cs_event_to_bitpos
 */
static inline uint32_t nrf52_i2cs_event_bit_get(NRF_TWIS_Type * const p_reg, nrf_twis_event_t ev)
{
  return (uint32_t)nrf_twis_event_get_and_clear(p_reg, ev) << nrf52_i2cs_event_to_bitpos(ev);
}

/**
 * @brief Auxiliary function for checking event bit inside given flags value
 *
 * Function used here to check presence of the event inside given flags value.
 * It transforms given event to bit possition and then checks if in given variable it is cleared.
 *
 * @param flags Flags to test
 * @param ev Event code
 *
 * @retval true Flag for selected event is set
 * @retval false Flag for selected event is cleared
 */
static inline bool nrf52_i2cs_check_bit(uint32_t flags, nrf_twis_event_t ev)
{
  return 0 != (flags & (1U << nrf52_i2cs_event_to_bitpos(ev)));
}

/**
 * @brief Auxiliary function for clearing event bit in given flags value
 *
 * Function used to clear selected event bit.
 *
 * @param flags Flags to process
 * @param ev    Event code to clear
 *
 * @return Value @em flags with cleared event bit that matches given @em ev
 */
static inline uint32_t nrf52_i2cs_clear_bit(uint32_t flags, nrf_twis_event_t ev)
{
  return flags & ~(1U << nrf52_i2cs_event_to_bitpos(ev));
}

static void nrf52_i2cs_worker(void *arg)
{
  struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)arg;
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;
  int (*callback)(FAR void *, i2c_slave_flag );
  void *callback_args;
  irqstate_t flags;


  flags = enter_critical_section();
  callback = priv->callback;
  callback_args = priv->callback_args;
  leave_critical_section(flags);

  if (priv->status == NRF52_TWIS_STATE_READ_WAITING)
    {
      if (callback != NULL)
        {
          callback(callback_args, I2CS_R);
        }

      /*if the user doesn't set callback function or
       *the user doesn't set tx buffer in the callback function
       */
      if (!priv->flag_tx_buffer_set)
        {
          nrf_twis_task_trigger(twis, NRF_TWIS_TASK_STOP);
        }
    }
  else if (priv->status == NRF52_TWIS_STATE_WRITE_WAITING)
    {
      if (callback != NULL)
        {
          callback(callback_args, I2CS_W);
        }

      /*if the user doesn't set callback function or
       *the user doesn't set rx buffer in the callback function
       */
      if (!priv->flag_rx_buffer_set)
        {
          nrf_twis_task_trigger(twis, NRF_TWIS_TASK_STOP);
        }
    }
  else
    {
      /*if something happend when we are waitting user to set TRX buffer*/
      nrf_twis_task_trigger(twis, NRF_TWIS_TASK_STOP);
    }

