redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
}


/**
 * @brief State machine main function
 *
 * State machine function that reacts on events.
 * This function gets all events and reacts on them only if there is any event detected.
 * It makes it possible to use it either in interrupt or in polling mode.
 * @param instNr Driver instance number that has called this runtime.
 */
static int nrf52_i2cs_isr(int irq, void *context, FAR void *arg)
{
  struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)arg;
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;
  int ret;

  DEBUGASSERT(priv != NULL);

  /* Current state copy  */
  nrf52_twis_state_t state = priv->status;

  /* Event flags */
  uint32_t ev = 0;

  /* Get all events */
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_STOPPED);
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_ERROR);
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_RXSTARTED);
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_TXSTARTED);
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_WRITE);
  ev |= nrf52_i2cs_event_bit_get(twis, NRF_TWIS_EVENT_READ);

  /* State machine */
  while (0 != ev)
    {
      switch (state)
        {
          case NRF52_TWIS_STATE_IDLE:
            if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
              {
                /* Stopped event is always allowed in IDLE state - just ignore */
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
              }
            else if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_READ))
              {

                if (priv->flag_rx_buffer_set)
                  {
                    priv->rx_error = true;
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_rx_buffer_set = false;

                if (priv->flag_tx_buffer_set)
                  {
                    nrf_twis_task_trigger(twis, NRF_TWIS_TASK_RESUME);
                    state = NRF52_TWIS_STATE_READING;
                  }
                else
                  {
                    state = NRF52_TWIS_STATE_READ_WAITING;
                    /*schedule worker*/
                    if (work_available(&priv->work))
                      {
                        /* call the user callback on the worker thread. */

                        ret = work_queue(LPWORK, &priv->work, nrf52_i2cs_worker, priv, 0);
                        if (ret != 0)
                          {
                            i2cerr("ERROR: Failed to queue work: %d\n", ret);
                          }
                      }

                  }
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_READ);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_WRITE);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
              }
            else if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_WRITE))
              {
                if (priv->flag_tx_buffer_set)
                  {
                    priv->tx_error = true;
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_tx_buffer_set = false;

                if (priv->flag_rx_buffer_set)
                  {
                    nrf_twis_task_trigger(twis, NRF_TWIS_TASK_RESUME);
                    state = NRF52_TWIS_STATE_WRITING;
                  }
                else
                  {
                    state = NRF52_TWIS_STATE_WRITE_WAITING;
                    /*schedule worker*/
                    if (work_available(&priv->work))
                      {
                        /* call the user callback on the worker thread. */

                        ret = work_queue(LPWORK, &priv->work, nrf52_i2cs_worker, priv, 0);
                        if (ret != 0)
                          {
                            i2cerr("ERROR: Failed to queue work: %d\n", ret);
                          }
                      }

                  }

                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_READ);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_WRITE);
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
              }
            else
              {
                /*error happend, I suppose it will never happen*/
                ev = 0;
              }
            break;
          case NRF52_TWIS_STATE_READ_WAITING:
            if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_TXSTARTED))
              {
                state = NRF52_TWIS_STATE_READING;
                /* Any other bits requires further processing in PENDING substate */
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
              }
            else
              {
                priv->tx_error = true;
                if (priv->flag_tx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_tx_buffer_set = false;
                state = NRF52_TWIS_STATE_IDLE;
                ev = 0;
              }
            break;
          case NRF52_TWIS_STATE_READING:
            if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_WRITE) ||
                nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_READ) ||
                nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
              {

                priv->sended_length = nrf_twis_tx_amount_get(twis);
                if (priv->flag_tx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_tx_buffer_set = false;

                /* Go to idle and repeat the state machine if READ or WRITE events detected.
                 * This time READ or WRITE would be started */
                state = NRF52_TWIS_STATE_IDLE;
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
              }
            else
              {
                priv->tx_error = true;
                if (priv->flag_tx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_tx_buffer_set = false;

