redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
                state = NRF52_TWIS_STATE_IDLE;
                ev = 0;
              }
            break;
          case NRF52_TWIS_STATE_WRITE_WAITING:
            if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_RXSTARTED))
              {
                state = NRF52_TWIS_STATE_WRITING;
                /* Any other bits requires further processing in PENDING substate */
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
              }
            else
              {
                priv->rx_error = true;
                if (priv->flag_rx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_rx_buffer_set = false;

                state = NRF52_TWIS_STATE_IDLE;
                ev = 0;
              }
            break;
          case NRF52_TWIS_STATE_WRITING:
            if (nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_WRITE) ||
                nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_READ) ||
                nrf52_i2cs_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
              {
                priv->received_length = nrf_twis_rx_amount_get(twis);
                if (priv->flag_rx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_rx_buffer_set = false;

                /* Go to idle and repeat the state machine if READ or WRITE events detected.
                 * This time READ or WRITE would be started */
                state = NRF52_TWIS_STATE_IDLE;
                ev = nrf52_i2cs_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
              }
            else
              {
                priv->rx_error = true;
                if (priv->flag_rx_buffer_set)
                  {
                    nxsem_post(&priv->sem_pend);
                  }
                priv->flag_rx_buffer_set = false;

                state = NRF52_TWIS_STATE_IDLE;
                ev = 0;
              }
            break;
          default:
            state = NRF52_TWIS_STATE_IDLE;
            /* Do not clear any events and repeat the machine */
            break;
        }
    }

  priv->status = state;

  return OK;
}



/*************************************************************************************
 * Name: nrf52_i2cs_reset
 *
 * Description:
 *   Reset all the registers to known state
 *
 *   This function clears all registers that requires it to known state.
 *   TWIS is left disabled after this function.
 *   All events are cleared.
 *
 * Input Parameters:
 *   p_reg -- TWIS to reset register address
 ************************************************************************************/
static inline void nrf52_i2cs_reset(FAR struct nrf52_i2cs_priv_s *priv)
{
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;

  /* Disable TWIS */
  nrf_twis_disable(twis);

  /* Disable interrupt global for the instance */
  up_disable_irq(priv->config->irqno);

  /*disable all shorts*/
  nrf_twis_shorts_disable(twis, NRF_TWIS_SHORT_WRITE_SUSPEND_MASK | NRF_TWIS_SHORT_READ_SUSPEND_MASK);

  /*clear all events*/
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_STOPPED);
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_ERROR);
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_RXSTARTED);
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_TXSTARTED);
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_WRITE);
  nrf_twis_event_clear(twis, NRF_TWIS_EVENT_READ);

  /* Disable interrupts */
  nrf_twis_int_disable(twis, NRF_TWIS_INT_STOPPED_MASK);
  nrf_twis_int_disable(twis, NRF_TWIS_INT_ERROR_MASK);
  nrf_twis_int_disable(twis, NRF_TWIS_INT_RXSTARTED_MASK);
  nrf_twis_int_disable(twis, NRF_TWIS_INT_TXSTARTED_MASK);
  nrf_twis_int_disable(twis, NRF_TWIS_INT_WRITE_MASK);
  nrf_twis_int_disable(twis, NRF_TWIS_INT_READ_MASK);

}


/*************************************************************************************
 * Name: nrf52_i2cs_config_pin
 *
 * Description:
 *   Configure pin
 *
 *   Function configures selected for work as SDA or SCL.
 *
 * Input Parameters:
 *   pin -- Pin number to configure
 ************************************************************************************/

static inline void nrf52_i2cs_config_pin(uint32_t pin, nrf_gpio_pin_pull_t pull)
{
  nrf_gpio_cfg(pin,
               NRF_GPIO_PIN_DIR_INPUT,
               NRF_GPIO_PIN_INPUT_DISCONNECT,
               pull,
               NRF_GPIO_PIN_S0D1,
               NRF_GPIO_PIN_NOSENSE);
}


/************************************************************************************
 * Name: nrf52_i2cs_init
 *
 * Description:
 *   Setup the I2C slave hardware, ready for operation with defaults
 *
 ************************************************************************************/

static int nrf52_i2cs_init(FAR struct nrf52_i2cs_priv_s *priv)
{
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;

  /*software reset*/
  nrf52_i2cs_reset(priv);

  /* Power-up and configure GPIOs */

  /* Configure pins */
  nrf52_i2cs_config_pin(priv->config->scl_pin, priv->config->scl_pullup);
  nrf52_i2cs_config_pin(priv->config->sda_pin, priv->config->sda_pullup);
  nrf_twis_pins_set(twis, priv->config->scl_pin, priv->config->sda_pin);

  /*disable all address*/
  nrf_twis_config_address_set(twis, 0);

  /*enable all shorts*/
  nrf_twis_shorts_enable(twis, NRF_TWIS_SHORT_WRITE_SUSPEND_MASK | NRF_TWIS_SHORT_READ_SUSPEND_MASK);

  /*set interrupt mask*/
  nrf_twis_int_enable(twis, NRF_TWIS_INT_STOPPED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_ERROR_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_RXSTARTED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_TXSTARTED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_WRITE_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_READ_MASK);

  /* Attach ISRs */
  irq_attach(priv->config->irqno, nrf52_i2cs_isr, priv);


  return OK;
}

/************************************************************************************
 * Name: nrf52_i2cs_deinit
 *
 * Description:
 *   Shutdown the I2C hardware
 *
 ************************************************************************************/

static int nrf52_i2cs_deinit(FAR struct nrf52_i2cs_priv_s *priv)
{
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;

  /* software reset */
  nrf52_i2cs_reset(priv);

  /* Clear pins configration */
  nrf_gpio_cfg_default(priv->config->scl_pin);
  nrf_gpio_cfg_default(priv->config->sda_pin);

  /* Disconnect pins */
  nrf_twis_pins_set(twis, ~0U, ~0U);

  /* Disable and detach interrupts */
  irq_detach(priv->config->irqno);

  return OK;
}

/************************************************************************************
 * Device Driver Operations
 ************************************************************************************/

/****************************************************************************
 * Name: I2CS_SETOWNADDRESS
 *
 * Description:
 *   Set our own I2C address. Calling this function enables Slave mode and
 *   disables Master mode on the I2C bus (note that I2C is a bus, where
 *   multiple masters and slave may be handled by one device driver).
 *
 *   One may register a callback to be notified about reception. During the
 *   slave mode reception, the methods READ and WRITE must be used to
 *   to handle reads and writes from a master.
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   address - Our own slave address; If it is 0x00, then the device driver
 *             listens to general call
 *   nbits   - The number of address bits provided (7 or 10)
 *
 * Returned Value:
 *   OK on valid address and if the same address has not been assigned
 *   to another instance sharing the same port. Otherwise ERROR is returned.
 *
 ****************************************************************************/
int nrf52_i2cs_enable(FAR struct i2c_slave_s *dev, int addr, int nbits)
{
  FAR struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)dev;
  int ret = OK;
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;

