redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
  /* Ensure that address or flags don't change meanwhile */

  nrf52_i2cs_sem_wait(priv);

  /*if we are reading or writting*/
  if (priv->status != NRF52_TWIS_STATE_IDLE)
    {
      return ERROR;
    }

  /*we only support 7bit address*/
  if (nbits != 7)
    {
      return ERROR;
    }

  /*if the address is bigger than 128*/
  if ((nbits == 7) && ((addr & (~0x0000007f)) != 0))
    {
      return ERROR;
    }

  /*reset the device*/
  nrf52_i2cs_reset(priv);

  /*set address*/
  nrf_twis_address_set(twis, 0, addr);
  nrf_twis_config_address_set(twis, NRF_TWIS_CONFIG_ADDRESS0_MASK);

  /*set interrupt mask*/
  nrf_twis_int_enable(twis, NRF_TWIS_INT_STOPPED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_ERROR_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_RXSTARTED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_TXSTARTED_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_WRITE_MASK);
  nrf_twis_int_enable(twis, NRF_TWIS_INT_READ_MASK);

  /*enable all shorts*/
  nrf_twis_shorts_enable(twis, NRF_TWIS_SHORT_WRITE_SUSPEND_MASK | NRF_TWIS_SHORT_READ_SUSPEND_MASK);


  /* enable irq */
  up_enable_irq(priv->config->irqno);

  /* enable TWIS */
  nrf_twis_enable(twis);

  nrf52_i2cs_sem_post(priv);
  return ret;


}

/****************************************************************************
 * Name: I2CS_WRITE
 *
 * Description:
 *   Send a block of data on I2C using the previously selected I2C
 *   frequency and slave address. Each write operational will be an 'atomic'
 *   operation in the sense that any other I2C actions will be serialized
 *   and pend until this write completes. Required.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buffer - A pointer to the read-only buffer of data to be written to device
 *   buflen - The number of bytes to send from the buffer
 *
 * Returned Value:
 *   return the tranferd length on success;
 *   return a negated errno on fail.
 *
 ****************************************************************************/
int nrf52_i2cs_write(FAR struct i2c_slave_s *dev, FAR const uint8_t *buffer,
                     int buflen)
{
  FAR struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)dev;
  int ret = OK;
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;
  irqstate_t flags;

  /* Ensure that address or flags don't change meanwhile */

  nrf52_i2cs_sem_wait(priv);

  /*we can do this only in idle status or master are waiting to read*/
  if ((priv->status != NRF52_TWIS_STATE_IDLE) && (priv->status != NRF52_TWIS_STATE_READ_WAITING))
    {
      i2cerr("write at a wrong occation! current:%s \n", STATUS_TO_STR_TWIM(priv->status));
      ret = ERROR;
      goto errout;
    }

  DEBUGASSERT(nrf_is_in_ram(buffer));

  /* Check data size */
  if ((buflen & TWIS_TXD_MAXCNT_MAXCNT_Msk) != buflen)
    {
      i2cerr("write too long! length:%d, MAX:%d \n", buflen, TWIS_TXD_MAXCNT_MAXCNT_Msk);
      ret = ERROR;
      goto errout;
    }

  flags = enter_critical_section();

  /*set tx buffer*/
  nrf_twis_tx_prepare(twis, (uint8_t const *)buffer, (nrf_twis_amount_t)buflen);
  priv->flag_tx_buffer_set = true;

  if (priv->status == NRF52_TWIS_STATE_READ_WAITING)
    {
      nrf_twis_task_trigger(twis, NRF_TWIS_TASK_RESUME);
    }

  leave_critical_section(flags);

  /*wait until the transfer is done*/
  do
    {
      /* Take the semaphore (perhaps waiting) */

      ret = nxsem_wait(&priv->sem_pend);

      /* The only case that an error should occur here is if the wait was
       * awakened by a signal.
       */

      DEBUGASSERT(ret == OK || ret == -EINTR);
    }
  while (ret == -EINTR);

  /*get transfer reuslt*/
  if (!priv->tx_error)
    {
      ret = priv->sended_length;
    }
  else
    {
      priv->tx_error = false;
      ret = ERROR;
    }

errout:
  nrf52_i2cs_sem_post(priv);
  return ret;


}

/****************************************************************************
 * Name: I2CS_READ
 *
 * Description:
 *   Receive a block of data from I2C using the previously selected I2C
 *   frequency and slave address. Each read operational will be an 'atomic'
 *   operation in the sense that any other I2C actions will be serialized
 *   and pend until this read completes. Required.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buffer - A pointer to a buffer of data to receive the data from the device
 *   buflen - The requested number of bytes to be read
 *
 * Returned Value:
 *   return the tranferd length on success;
 *   return a negated errno on fail.
 *
 ****************************************************************************/
int nrf52_i2cs_read(FAR struct i2c_slave_s *dev, FAR uint8_t *buffer,
                    int buflen)
{
  FAR struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)dev;
  int ret = OK;
  NRF_TWIS_Type *twis = (NRF_TWIS_Type *)priv->config->base;
  irqstate_t flags;

  /* Ensure that address or flags don't change meanwhile */

  nrf52_i2cs_sem_wait(priv);

  /*we can do this only in idle status or master are waiting to read*/
  if ((priv->status != NRF52_TWIS_STATE_IDLE) && (priv->status != NRF52_TWIS_STATE_WRITE_WAITING))
    {
      i2cerr("read at a wrong occation! current:%s \n", STATUS_TO_STR_TWIM(priv->status));
      ret = ERROR;
      goto errout;
    }

  DEBUGASSERT(nrf_is_in_ram(buffer));

  /* Check data size */
  if ((buflen & TWIS_TXD_MAXCNT_MAXCNT_Msk) != buflen)
    {
      i2cerr("read too long! length:%d, MAX:%d \n", buflen, TWIS_TXD_MAXCNT_MAXCNT_Msk);
      ret = ERROR;
      goto errout;
    }

  flags = enter_critical_section();

  /*set tx buffer*/
  nrf_twis_rx_prepare(twis, buffer, (nrf_twis_amount_t)buflen);
  priv->flag_rx_buffer_set = true;

  if (priv->status == NRF52_TWIS_STATE_WRITE_WAITING)
    {
      nrf_twis_task_trigger(twis, NRF_TWIS_TASK_RESUME);
    }

  leave_critical_section(flags);


  do
    {
      /* Take the semaphore (perhaps waiting) */

      ret = nxsem_wait(&priv->sem_pend);

      /* The only case that an error should occur here is if the wait was
       * awakened by a signal.
       */

      DEBUGASSERT(ret == OK || ret == -EINTR);
    }
  while (ret == -EINTR);

  /*get transfer reuslt*/
  if (!priv->rx_error)
    {
      ret = priv->received_length;
    }
  else
    {
      priv->rx_error = false;
      ret = ERROR;
    }

errout:
  nrf52_i2cs_sem_post(priv);
  return ret;


