redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_i2c_slave.c
}

/****************************************************************************
 * Name: I2CS_REGISTERCALLBACK
 *
 * Description:
 *   Register to receive a callback when something is received on I2C.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   callback - The function to be called when something has been received.
 *   arg      - User provided argument to be used with the callback
 *
 * Returned Value:
 *   0: success, <0: A negated errno
 *
 ****************************************************************************/
int nrf52_i2cs_registercb(FAR struct i2c_slave_s *dev,
                          int (*callback)(FAR void *arg, i2c_slave_flag flag), FAR void *arg)
{
  FAR struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)dev;
  irqstate_t flags;


  flags = enter_critical_section();
  priv->callback = callback;
  priv->callback_args = arg;
  leave_critical_section(flags);

  return OK;
}



/************************************************************************************
 * Public Functions
 ************************************************************************************/
/************************************************************************************
 * Name: nrf52_i2cslave_initialize
 *
 * Description:
 *   Initialize one I2C slave
 *
 ************************************************************************************/

FAR struct i2c_slave_s *nrf52_i2cslave_initialize(int port)
{
  struct nrf52_i2cs_priv_s *priv = NULL;
  irqstate_t flags;

  /* Get I2C private structure */

  switch (port)
    {
#ifdef CONFIG_NRF52_I2CS0
      case 0:
        priv = (struct nrf52_i2cs_priv_s *)&nrf52_i2cs0_priv;
        break;
#endif
#ifdef CONFIG_NRF52_I2CS1
      case 1:
        priv = (struct nrf52_i2cs_priv_s *)&nrf52_i2cs1_priv;
        break;
#endif
      default:
        return NULL;
    }

  /* Initialize private data for the first time, increment reference count,
   * power-up hardware and configure GPIOs.
   */

  flags = enter_critical_section();

  if ((volatile int)priv->refs++ == 0)
    {
      leave_critical_section(flags);

      nrf52_i2cs_sem_init(priv);
      nrf52_i2cs_init(priv);

      flags = enter_critical_section();

    }

  leave_critical_section(flags);
  return (struct i2c_slave_s *)priv;
}


/****************************************************************************
 * Name: nrf52_i2cslave_uninitialize
 *
 * Description:
 *   Uninitialise an I2C slave device
 *
 ****************************************************************************/
int nrf52_i2cslave_uninitialize(FAR struct i2c_slave_s *dev)
{
  FAR struct nrf52_i2cs_priv_s *priv = (struct nrf52_i2cs_priv_s *)dev;
  irqstate_t flags;

  ASSERT(dev);

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resource (GPIO's) */

  nrf52_i2cs_deinit(priv);

  /* Release unused resources */

  nrf52_i2cs_sem_destroy(priv);
  return OK;
}


#endif /*CONFIG_NRF52_I2CS0 CONFIG_NRF52_I2CS1 */
